app/controllers/hello_worlds_controller.rb

  def index
    @hello_worlds = HelloWorld.all
---
SELECT "hello_worlds".* FROM "hello_worlds"

    def set_hello_world
      @hello_world = HelloWorld.find(params[:id])
---
SELECT  "hello_worlds".* FROM "hello_worlds" WHERE "hello_worlds"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]